cfe llm/Catalogs/AI_Провайдеры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>AI_Провайдеры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПровайдера</Name>
					<Type>
						<v8:Type>cfg:EnumRef.AI_ТипПровайдера</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>APIКлюч</Name>					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксКоличествоПотоков</Name>					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПровайдерИсточникAPI</Name>					<Type>
						<v8:Type>cfg:CatalogRef.AI_Провайдеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛимитRPM</Name>					<Comment>0 — без лимита. Максимум запросов в минуту к провайдеру.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛимитТокеновВСутки</Name>					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодельАнализаВложений</Name>					<Type>
						<v8:Type>cfg:CatalogRef.AI_Модели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаймаутСек</Name>					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРазбораВложений</Name>					<Type>
						<v8:Type>d5p1:EnumRef.AI_СпособРазбораВложений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>АдресаСервисов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>БазовыйURL</Name>							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип</Name>							<Type>
								<v8:Type>cfg:EnumRef.AI_ТипAPI</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfe llm/Catalogs/AI_Провайдеры/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ApiКлюч = ТекущийОбъект.ApiКлюч.Получить();
	Если Не ЗначениеЗаполнено(ТекущийОбъект.ТипПровайдера) Тогда
		ТекущийОбъект.ТипПровайдера =
			Справочники.AI_Провайдеры.ПолучитьТипПровайдера(
				ТекущийОбъект.Ссылка);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьНастройкиZAI();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Справочники.AI_Провайдеры.ЗаполнитьНастройкиПоУмолчанию(ТекущийОбъект);
	ТекущийОбъект.APIКлюч = Новый ХранилищеЗначения(ApiКлюч);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

// Список моделей запрашивается по сохраненным адресу и ключу, поэтому карточка
// сначала записывается; не записалась — запрашивать нечем.
&НаКлиенте
Процедура ЗагрузитьМодели(Команда)

	Если Не Записать() Тогда
		Возврат;
	КонецЕсли;
	ПараметрыФормы = Новый Структура("Провайдер", Объект.Ссылка);
	ОткрытьФорму(
		"Справочник.AI_Провайдеры.Форма.ВыборМоделей",
		ПараметрыФормы,
		ЭтаФорма);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНастройкиZAI()

	Справочники.AI_Провайдеры.ЗаполнитьНастройкиПоУмолчанию(Объект);

КонецПроцедуры

#КонецОбласти
